liuhuaxijun/pro07_STM32F405RGT6_bike/Int/lsm6dsm_reg.h
/**
 ******************************************************************************
 * @file    lsm6dsm_reg.h
 * @author  Sensors Software Solution Team
 * @brief   This file contains all the functions prototypes for the
 *          lsm6dsm_reg.c driver.
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2021 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef LSM6DSM_REGS_H
#define LSM6DSM_REGS_H

#ifdef __cplusplus
extern "C"
{
#endif

/* Includes ------------------------------------------------------------------*/
#include <stdint.h>
#include <stddef.h>
#include <math.h>

  /** @addtogroup LSM6DSM
   * @{
   *
   */

  /** @defgroup  Endianness definitions
   * @{
   *
   */

#ifndef DRV_BYTE_ORDER
#ifndef __BYTE_ORDER__

#define DRV_LITTLE_ENDIAN 1234
#define DRV_BIG_ENDIAN 4321

/** if _BYTE_ORDER is not defined, choose the endianness of your architecture
 * by uncommenting the define which fits your platform endianness
 */
// #define DRV_BYTE_ORDER    DRV_BIG_ENDIAN
#define DRV_BYTE_ORDER DRV_LITTLE_ENDIAN

#else /* defined __BYTE_ORDER__ */

#define DRV_LITTLE_ENDIAN __ORDER_LITTLE_ENDIAN__
#define DRV_BIG_ENDIAN __ORDER_BIG_ENDIAN__
#define DRV_BYTE_ORDER __BYTE_ORDER__

#endif /* __BYTE_ORDER__*/
#endif /* DRV_BYTE_ORDER */

  /**
   * @}
   *
   */

  /** @defgroup STMicroelectronics sensors common types
   * @{
   *
   */

#ifndef MEMS_SHARED_TYPES
#define MEMS_SHARED_TYPES

  typedef struct
  {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
    uint8_t bit0 : 1;
    uint8_t bit1 : 1;
    uint8_t bit2 : 1;
    uint8_t bit3 : 1;
    uint8_t bit4 : 1;
    uint8_t bit5 : 1;
    uint8_t bit6 : 1;
    uint8_t bit7 : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
    uint8_t bit7 : 1;
    uint8_t bit6 : 1;
    uint8_t bit5 : 1;
    uint8_t bit4 : 1;
    uint8_t bit3 : 1;
    uint8_t bit2 : 1;
    uint8_t bit1 : 1;
    uint8_t bit0 : 1;
#endif /* DRV_BYTE_ORDER */
  } bitwise_t;

#define PROPERTY_DISABLE (0U)
#define PROPERTY_ENABLE (1U)

  /** @addtogroup  Interfaces_Functions
   * @brief       This section provide a set of functions used to read and
   *              write a generic register of the device.
   *              MANDATORY: return 0 -> no Error.
   * @{
   *
   */

  typedef int32_t (*stmdev_write_ptr)(
      void *handle,
      uint8_t reg,
      const uint8_t *buf,
      uint16_t len);

  typedef int32_t (*stmdev_read_ptr)(
      void *handle,
      uint8_t reg,
      uint8_t *buf,
      uint16_t len);

  typedef void (*stmdev_mdelay_ptr)(uint32_t millisec);

  typedef struct
  {
    /** Component mandatory fields **/
    stmdev_write_ptr write_reg;
    stmdev_read_ptr read_reg;
    /** Component optional fields **/
    stmdev_mdelay_ptr mdelay;
    /** Customizable optional pointer **/
    void *handle;

    /** private data **/
    void *priv_data;
  } stmdev_ctx_t;

  /**
   * @}
   *
   */

#endif /* MEMS_SHARED_TYPES */

#ifndef MEMS_UCF_SHARED_TYPES
#define MEMS_UCF_SHARED_TYPES

  /** @defgroup    Generic address-data structure definition
   * @brief       This structure is useful to load a predefined configuration
   *              of a sensor.
   *              You can create a sensor configuration by your own or using
   *              Unico / Unicleo tools available on STMicroelectronics
   *              web site.
   *
   * @{
   *
   */

  typedef struct
  {
    uint8_t address;
    uint8_t data;
  } ucf_line_t;

  /**
   * @}
   *
   */

#endif /* MEMS_UCF_SHARED_TYPES */

/**
 * @}
 *
 */

/** @defgroup LSM6DSM_Infos
 * @{
 *
 */

/** I2C Device Address 8 bit format  if SA0=0 -> D5 if SA0=1 -> D7 **/
#define LSM6DSM_I2C_ADD_L 0xD5U
#define LSM6DSM_I2C_ADD_H 0xD7U

/** Device Identification (Who am I) **/
#define LSM6DSM_ID 0x6AU

  /**
   * @}
   *
   */

#define LSM6DSM_FUNC_CFG_ACCESS 0x01U
  typedef struct
  {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
    uint8_t not_used_01 : 5;
    uint8_t func_cfg_en : 3; /* func_cfg_en + func_cfg_en_b */
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t func_cfg_en : 3; /* func_cfg_en + func_cfg_en_b */
  uint8_t not_used_01 : 5;
#endif /* DRV_BYTE_ORDER */
  } lsm6dsm_func_cfg_access_t;

#define LSM6DSM_SENSOR_SYNC_TIME_FRAME 0x04U
  typedef struct
  {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
    uint8_t tph : 4;
    uint8_t not_used_01 : 4;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used_01 : 4;
  uint8_t tph : 4;
#endif /* DRV_BYTE_ORDER */
  } lsm6dsm_sensor_sync_time_frame_t;

#define LSM6DSM_SENSOR_SYNC_RES_RATIO 0x05U
  typedef struct
  {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
    uint8_t rr : 2;
    uint8_t not_used_01 : 6;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used_01 : 6;
  uint8_t rr : 2;
#endif /* DRV_BYTE_ORDER */
  } lsm6dsm_sensor_sync_res_ratio_t;

#define LSM6DSM_FIFO_CTRL1 0x06U
  typedef struct
  {
    uint8_t fth : 8; /* + FIFO_CTRL2(fth) */
  } lsm6dsm_fifo_ctrl1_t;

#define LSM6DSM_FIFO_CTRL2 0x07U
  typedef struct
  {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
    uint8_t fth : 3; /* + FIFO_CTRL1(fth) */
    uint8_t fifo_temp_en : 1;
    uint8_t not_used_01 : 2;
    uint8_t timer_pedo_fifo_drdy : 1;
    uint8_t timer_pedo_fifo_en : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t timer_pedo_fifo_en : 1;
  uint8_t timer_pedo_fifo_drdy : 1;
  uint8_t not_used_01 : 2;
  uint8_t fifo_temp_en : 1;
  uint8_t fth : 3; /* + FIFO_CTRL1(fth) */
#endif /* DRV_BYTE_ORDER */
  } lsm6dsm_fifo_ctrl2_t;

#define LSM6DSM_FIFO_CTRL3 0x08U
  typedef struct
  {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
    uint8_t dec_fifo_xl : 3;
    uint8_t dec_fifo_gyro : 3;
    uint8_t not_used_01 : 2;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used_01 : 2;
  uint8_t dec_fifo_gyro : 3;
  uint8_t dec_fifo_xl : 3;
#endif /* DRV_BYTE_ORDER */
  } lsm6dsm_fifo_ctrl3_t;

#define LSM6DSM_FIFO_CTRL4 0x09U
  typedef struct
  {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
    uint8_t dec_ds3_fifo : 3;
    uint8_t dec_ds4_fifo : 3;
    uint8_t only_high_data : 1;
    uint8_t stop_on_fth : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t stop_on_fth : 1;
  uint8_t only_high_data : 1;
  uint8_t dec_ds4_fifo : 3;
  uint8_t dec_ds3_fifo : 3;
#endif /* DRV_BYTE_ORDER */
  } lsm6dsm_fifo_ctrl4_t;

#define LSM6DSM_FIFO_CTRL5 0x0AU
  typedef struct
  {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
    uint8_t fifo_mode : 3;
    uint8_t odr_fifo : 4;
    uint8_t not_used_01 : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used_01 : 1;
  uint8_t odr_fifo : 4;
  uint8_t fifo_mode : 3;
#endif /* DRV_BYTE_ORDER */
  } lsm6dsm_fifo_ctrl5_t;

#define LSM6DSM_DRDY_PULSE_CFG 0x0BU
  typedef struct
  {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
    uint8_t int2_wrist_tilt : 1;
    uint8_t not_used_01 : 6;
    uint8_t drdy_pulsed : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t drdy_pulsed : 1;
  uint8_t not_used_01 : 6;
  uint8_t int2_wrist_tilt : 1;
#endif /* DRV_BYTE_ORDER */
  } lsm6dsm_drdy_pulse_cfg_t;

