liuhuaxijun/pro07_STM32F405RGT6_bike/Int/lsm6dsm_reg.h
#define LSM6DSM_INT1_CTRL 0x0DU
  typedef struct
  {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
    uint8_t int1_drdy_xl : 1;
    uint8_t int1_drdy_g : 1;
    uint8_t int1_boot : 1;
    uint8_t int1_fth : 1;
    uint8_t int1_fifo_ovr : 1;
    uint8_t int1_full_flag : 1;
    uint8_t int1_sign_mot : 1;
    uint8_t int1_step_detector : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t int1_step_detector : 1;
  uint8_t int1_sign_mot : 1;
  uint8_t int1_full_flag : 1;
  uint8_t int1_fifo_ovr : 1;
  uint8_t int1_fth : 1;
  uint8_t int1_boot : 1;
  uint8_t int1_drdy_g : 1;
  uint8_t int1_drdy_xl : 1;
#endif /* DRV_BYTE_ORDER */
  } lsm6dsm_int1_ctrl_t;

#define LSM6DSM_INT2_CTRL 0x0EU
  typedef struct
  {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
    uint8_t int2_drdy_xl : 1;
    uint8_t int2_drdy_g : 1;
    uint8_t int2_drdy_temp : 1;
    uint8_t int2_fth : 1;
    uint8_t int2_fifo_ovr : 1;
    uint8_t int2_full_flag : 1;
    uint8_t int2_step_count_ov : 1;
    uint8_t int2_step_delta : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t int2_step_delta : 1;
  uint8_t int2_step_count_ov : 1;
  uint8_t int2_full_flag : 1;
  uint8_t int2_fifo_ovr : 1;
  uint8_t int2_fth : 1;
  uint8_t int2_drdy_temp : 1;
  uint8_t int2_drdy_g : 1;
  uint8_t int2_drdy_xl : 1;
#endif /* DRV_BYTE_ORDER */
  } lsm6dsm_int2_ctrl_t;

#define LSM6DSM_WHO_AM_I 0x0FU
#define LSM6DSM_CTRL1_XL 0x10U
  typedef struct
  {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
    uint8_t bw0_xl : 1;
    uint8_t lpf1_bw_sel : 1;
    uint8_t fs_xl : 2;
    uint8_t odr_xl : 4;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t odr_xl : 4;
  uint8_t fs_xl : 2;
  uint8_t lpf1_bw_sel : 1;
  uint8_t bw0_xl : 1;
#endif /* DRV_BYTE_ORDER */
  } lsm6dsm_ctrl1_xl_t;

#define LSM6DSM_CTRL2_G 0x11U
  typedef struct
  {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
    uint8_t not_used_01 : 1;
    uint8_t fs_g : 3; /* fs_g + fs_125 */
    uint8_t odr_g : 4;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t odr_g : 4;
  uint8_t fs_g : 3; /* fs_g + fs_125 */
  uint8_t not_used_01 : 1;
#endif /* DRV_BYTE_ORDER */
  } lsm6dsm_ctrl2_g_t;

#define LSM6DSM_CTRL3_C 0x12U
  typedef struct
  {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
    uint8_t sw_reset : 1;
    uint8_t ble : 1;
    uint8_t if_inc : 1;
    uint8_t sim : 1;
    uint8_t pp_od : 1;
    uint8_t h_lactive : 1;
    uint8_t bdu : 1;
    uint8_t boot : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t boot : 1;
  uint8_t bdu : 1;
  uint8_t h_lactive : 1;
  uint8_t pp_od : 1;
  uint8_t sim : 1;
  uint8_t if_inc : 1;
  uint8_t ble : 1;
  uint8_t sw_reset : 1;
#endif /* DRV_BYTE_ORDER */
  } lsm6dsm_ctrl3_c_t;

#define LSM6DSM_CTRL4_C 0x13U
  typedef struct
  {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
    uint8_t not_used_01 : 1;
    uint8_t lpf1_sel_g : 1;
    uint8_t i2c_disable : 1;
    uint8_t drdy_mask : 1;
    uint8_t den_drdy_int1 : 1;
    uint8_t int2_on_int1 : 1;
    uint8_t sleep : 1;
    uint8_t den_xl_en : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t den_xl_en : 1;
  uint8_t sleep : 1;
  uint8_t int2_on_int1 : 1;
  uint8_t den_drdy_int1 : 1;
  uint8_t drdy_mask : 1;
  uint8_t i2c_disable : 1;
  uint8_t lpf1_sel_g : 1;
  uint8_t not_used_01 : 1;
#endif /* DRV_BYTE_ORDER */
  } lsm6dsm_ctrl4_c_t;

#define LSM6DSM_CTRL5_C 0x14U
  typedef struct
  {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
    uint8_t st_xl : 2;
    uint8_t st_g : 2;
    uint8_t den_lh : 1;
    uint8_t rounding : 3;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t rounding : 3;
  uint8_t den_lh : 1;
  uint8_t st_g : 2;
  uint8_t st_xl : 2;
#endif /* DRV_BYTE_ORDER */
  } lsm6dsm_ctrl5_c_t;

#define LSM6DSM_CTRL6_C 0x15U
  typedef struct
  {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
    uint8_t ftype : 2;
    uint8_t not_used_01 : 1;
    uint8_t usr_off_w : 1;
    uint8_t xl_hm_mode : 1;
    uint8_t den_mode : 3; /* trig_en + lvl_en + lvl2_en */
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t den_mode : 3; /* trig_en + lvl_en + lvl2_en */
  uint8_t xl_hm_mode : 1;
  uint8_t usr_off_w : 1;
  uint8_t not_used_01 : 1;
  uint8_t ftype : 2;
#endif /* DRV_BYTE_ORDER */
  } lsm6dsm_ctrl6_c_t;

#define LSM6DSM_CTRL7_G 0x16U
  typedef struct
  {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
    uint8_t not_used_01 : 2;
    uint8_t rounding_status : 1;
    uint8_t not_used_02 : 1;
    uint8_t hpm_g : 2;
    uint8_t hp_en_g : 1;
    uint8_t g_hm_mode : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t g_hm_mode : 1;
  uint8_t hp_en_g : 1;
  uint8_t hpm_g : 2;
  uint8_t not_used_02 : 1;
  uint8_t rounding_status : 1;
  uint8_t not_used_01 : 2;
#endif /* DRV_BYTE_ORDER */
  } lsm6dsm_ctrl7_g_t;

#define LSM6DSM_CTRL8_XL 0x17U
  typedef struct
  {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
    uint8_t low_pass_on_6d : 1;
    uint8_t not_used_01 : 1;
    uint8_t hp_slope_xl_en : 1;
    uint8_t input_composite : 1;
    uint8_t hp_ref_mode : 1;
    uint8_t hpcf_xl : 2;
    uint8_t lpf2_xl_en : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t lpf2_xl_en : 1;
  uint8_t hpcf_xl : 2;
  uint8_t hp_ref_mode : 1;
  uint8_t input_composite : 1;
  uint8_t hp_slope_xl_en : 1;
  uint8_t not_used_01 : 1;
  uint8_t low_pass_on_6d : 1;
#endif /* DRV_BYTE_ORDER */
  } lsm6dsm_ctrl8_xl_t;

#define LSM6DSM_CTRL9_XL 0x18U
  typedef struct
  {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
    uint8_t not_used_01 : 2;
    uint8_t soft_en : 1;
    uint8_t not_used_02 : 1;
    uint8_t den_xl_g : 1;
    uint8_t den_z : 1;
    uint8_t den_y : 1;
    uint8_t den_x : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t den_x : 1;
  uint8_t den_y : 1;
  uint8_t den_z : 1;
  uint8_t den_xl_g : 1;
  uint8_t not_used_02 : 1;
  uint8_t soft_en : 1;
  uint8_t not_used_01 : 2;
#endif /* DRV_BYTE_ORDER */
  } lsm6dsm_ctrl9_xl_t;

#define LSM6DSM_CTRL10_C 0x19U
  typedef struct
  {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
    uint8_t sign_motion_en : 1;
    uint8_t pedo_rst_step : 1;
    uint8_t func_en : 1;
    uint8_t tilt_en : 1;
    uint8_t pedo_en : 1;
    uint8_t timer_en : 1;
    uint8_t not_used_01 : 1;
    uint8_t wrist_tilt_en : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t wrist_tilt_en : 1;
  uint8_t not_used_01 : 1;
  uint8_t timer_en : 1;
  uint8_t pedo_en : 1;
  uint8_t tilt_en : 1;
  uint8_t func_en : 1;
  uint8_t pedo_rst_step : 1;
  uint8_t sign_motion_en : 1;
#endif /* DRV_BYTE_ORDER */
  } lsm6dsm_ctrl10_c_t;

#define LSM6DSM_MASTER_CONFIG 0x1AU
  typedef struct
  {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
    uint8_t master_on : 1;
    uint8_t iron_en : 1;
    uint8_t pass_through_mode : 1;
    uint8_t pull_up_en : 1;
    uint8_t start_config : 1;
    uint8_t not_used_01 : 1;
    uint8_t data_valid_sel_fifo : 1;
    uint8_t drdy_on_int1 : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t drdy_on_int1 : 1;
  uint8_t data_valid_sel_fifo : 1;
  uint8_t not_used_01 : 1;
  uint8_t start_config : 1;
  uint8_t pull_up_en : 1;
  uint8_t pass_through_mode : 1;
  uint8_t iron_en : 1;
  uint8_t master_on : 1;
#endif /* DRV_BYTE_ORDER */
  } lsm6dsm_master_config_t;

#define LSM6DSM_WAKE_UP_SRC 0x1BU
  typedef struct
  {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
    uint8_t z_wu : 1;
    uint8_t y_wu : 1;
    uint8_t x_wu : 1;
    uint8_t wu_ia : 1;
    uint8_t sleep_state_ia : 1;
    uint8_t ff_ia : 1;
    uint8_t not_used_01 : 2;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used_01 : 2;
  uint8_t ff_ia : 1;
  uint8_t sleep_state_ia : 1;
  uint8_t wu_ia : 1;
  uint8_t x_wu : 1;
  uint8_t y_wu : 1;
  uint8_t z_wu : 1;
#endif /* DRV_BYTE_ORDER */
  } lsm6dsm_wake_up_src_t;

