liuhuaxijun/pro07_STM32F405RGT6_bike/Int/lsm6dsm_reg.h
#define LSM6DSM_TAP_SRC 0x1CU
  typedef struct
  {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
    uint8_t z_tap : 1;
    uint8_t y_tap : 1;
    uint8_t x_tap : 1;
    uint8_t tap_sign : 1;
    uint8_t double_tap : 1;
    uint8_t single_tap : 1;
    uint8_t tap_ia : 1;
    uint8_t not_used_01 : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used_01 : 1;
  uint8_t tap_ia : 1;
  uint8_t single_tap : 1;
  uint8_t double_tap : 1;
  uint8_t tap_sign : 1;
  uint8_t x_tap : 1;
  uint8_t y_tap : 1;
  uint8_t z_tap : 1;
#endif /* DRV_BYTE_ORDER */
  } lsm6dsm_tap_src_t;

#define LSM6DSM_D6D_SRC 0x1DU
  typedef struct
  {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
    uint8_t xl : 1;
    uint8_t xh : 1;
    uint8_t yl : 1;
    uint8_t yh : 1;
    uint8_t zl : 1;
    uint8_t zh : 1;
    uint8_t d6d_ia : 1;
    uint8_t den_drdy : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t den_drdy : 1;
  uint8_t d6d_ia : 1;
  uint8_t zh : 1;
  uint8_t zl : 1;
  uint8_t yh : 1;
  uint8_t yl : 1;
  uint8_t xh : 1;
  uint8_t xl : 1;
#endif /* DRV_BYTE_ORDER */
  } lsm6dsm_d6d_src_t;

#define LSM6DSM_STATUS_REG 0x1EU
  typedef struct
  {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
    uint8_t xlda : 1;
    uint8_t gda : 1;
    uint8_t tda : 1;
    uint8_t not_used_01 : 5;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used_01 : 5;
  uint8_t tda : 1;
  uint8_t gda : 1;
  uint8_t xlda : 1;
#endif /* DRV_BYTE_ORDER */
  } lsm6dsm_status_reg_t;

#define LSM6DSM_STATUS_SPIAUX 0x1EU
  typedef struct
  {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
    uint8_t xlda : 1;
    uint8_t gda : 1;
    uint8_t gyro_settling : 1;
    uint8_t not_used_01 : 5;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used_01 : 5;
  uint8_t gyro_settling : 1;
  uint8_t gda : 1;
  uint8_t xlda : 1;
#endif /* DRV_BYTE_ORDER */
  } lsm6dsm_status_spiaux_t;

#define LSM6DSM_OUT_TEMP_L 0x20U
#define LSM6DSM_OUT_TEMP_H 0x21U
#define LSM6DSM_OUTX_L_G 0x22U
#define LSM6DSM_OUTX_H_G 0x23U
#define LSM6DSM_OUTY_L_G 0x24U
#define LSM6DSM_OUTY_H_G 0x25U
#define LSM6DSM_OUTZ_L_G 0x26U
#define LSM6DSM_OUTZ_H_G 0x27U
#define LSM6DSM_OUTX_L_XL 0x28U
#define LSM6DSM_OUTX_H_XL 0x29U
#define LSM6DSM_OUTY_L_XL 0x2AU
#define LSM6DSM_OUTY_H_XL 0x2BU
#define LSM6DSM_OUTZ_L_XL 0x2CU
#define LSM6DSM_OUTZ_H_XL 0x2DU
#define LSM6DSM_SENSORHUB1_REG 0x2EU
  typedef struct
  {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
    uint8_t bit0 : 1;
    uint8_t bit1 : 1;
    uint8_t bit2 : 1;
    uint8_t bit3 : 1;
    uint8_t bit4 : 1;
    uint8_t bit5 : 1;
    uint8_t bit6 : 1;
    uint8_t bit7 : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t bit7 : 1;
  uint8_t bit6 : 1;
  uint8_t bit5 : 1;
  uint8_t bit4 : 1;
  uint8_t bit3 : 1;
  uint8_t bit2 : 1;
  uint8_t bit1 : 1;
  uint8_t bit0 : 1;
#endif /* DRV_BYTE_ORDER */
  } lsm6dsm_sensorhub1_reg_t;

#define LSM6DSM_SENSORHUB2_REG 0x2FU
  typedef struct
  {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
    uint8_t bit0 : 1;
    uint8_t bit1 : 1;
    uint8_t bit2 : 1;
    uint8_t bit3 : 1;
    uint8_t bit4 : 1;
    uint8_t bit5 : 1;
    uint8_t bit6 : 1;
    uint8_t bit7 : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t bit7 : 1;
  uint8_t bit6 : 1;
  uint8_t bit5 : 1;
  uint8_t bit4 : 1;
  uint8_t bit3 : 1;
  uint8_t bit2 : 1;
  uint8_t bit1 : 1;
  uint8_t bit0 : 1;
#endif /* DRV_BYTE_ORDER */
  } lsm6dsm_sensorhub2_reg_t;

#define LSM6DSM_SENSORHUB3_REG 0x30U
  typedef struct
  {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
    uint8_t bit0 : 1;
    uint8_t bit1 : 1;
    uint8_t bit2 : 1;
    uint8_t bit3 : 1;
    uint8_t bit4 : 1;
    uint8_t bit5 : 1;
    uint8_t bit6 : 1;
    uint8_t bit7 : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t bit7 : 1;
  uint8_t bit6 : 1;
  uint8_t bit5 : 1;
  uint8_t bit4 : 1;
  uint8_t bit3 : 1;
  uint8_t bit2 : 1;
  uint8_t bit1 : 1;
  uint8_t bit0 : 1;
#endif /* DRV_BYTE_ORDER */
  } lsm6dsm_sensorhub3_reg_t;

#define LSM6DSM_SENSORHUB4_REG 0x31U
  typedef struct
  {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
    uint8_t bit0 : 1;
    uint8_t bit1 : 1;
    uint8_t bit2 : 1;
    uint8_t bit3 : 1;
    uint8_t bit4 : 1;
    uint8_t bit5 : 1;
    uint8_t bit6 : 1;
    uint8_t bit7 : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t bit7 : 1;
  uint8_t bit6 : 1;
  uint8_t bit5 : 1;
  uint8_t bit4 : 1;
  uint8_t bit3 : 1;
  uint8_t bit2 : 1;
  uint8_t bit1 : 1;
  uint8_t bit0 : 1;
#endif /* DRV_BYTE_ORDER */
  } lsm6dsm_sensorhub4_reg_t;

#define LSM6DSM_SENSORHUB5_REG 0x32U
  typedef struct
  {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
    uint8_t bit0 : 1;
    uint8_t bit1 : 1;
    uint8_t bit2 : 1;
    uint8_t bit3 : 1;
    uint8_t bit4 : 1;
    uint8_t bit5 : 1;
    uint8_t bit6 : 1;
    uint8_t bit7 : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t bit7 : 1;
  uint8_t bit6 : 1;
  uint8_t bit5 : 1;
  uint8_t bit4 : 1;
  uint8_t bit3 : 1;
  uint8_t bit2 : 1;
  uint8_t bit1 : 1;
  uint8_t bit0 : 1;
#endif /* DRV_BYTE_ORDER */
  } lsm6dsm_sensorhub5_reg_t;

#define LSM6DSM_SENSORHUB6_REG 0x33U
  typedef struct
  {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
    uint8_t bit0 : 1;
    uint8_t bit1 : 1;
    uint8_t bit2 : 1;
    uint8_t bit3 : 1;
    uint8_t bit4 : 1;
    uint8_t bit5 : 1;
    uint8_t bit6 : 1;
    uint8_t bit7 : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t bit7 : 1;
  uint8_t bit6 : 1;
  uint8_t bit5 : 1;
  uint8_t bit4 : 1;
  uint8_t bit3 : 1;
  uint8_t bit2 : 1;
  uint8_t bit1 : 1;
  uint8_t bit0 : 1;
#endif /* DRV_BYTE_ORDER */
  } lsm6dsm_sensorhub6_reg_t;

#define LSM6DSM_SENSORHUB7_REG 0x34U
  typedef struct
  {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
    uint8_t bit0 : 1;
    uint8_t bit1 : 1;
    uint8_t bit2 : 1;
    uint8_t bit3 : 1;
    uint8_t bit4 : 1;
    uint8_t bit5 : 1;
    uint8_t bit6 : 1;
    uint8_t bit7 : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t bit7 : 1;
  uint8_t bit6 : 1;
  uint8_t bit5 : 1;
  uint8_t bit4 : 1;
  uint8_t bit3 : 1;
  uint8_t bit2 : 1;
  uint8_t bit1 : 1;
  uint8_t bit0 : 1;
#endif /* DRV_BYTE_ORDER */
  } lsm6dsm_sensorhub7_reg_t;

