liuhuaxijun/pro07_STM32F405RGT6_bike/Int/lsm6dsm_reg.h
#define LSM6DSM_SENSORHUB8_REG 0x35U
  typedef struct
  {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
    uint8_t bit0 : 1;
    uint8_t bit1 : 1;
    uint8_t bit2 : 1;
    uint8_t bit3 : 1;
    uint8_t bit4 : 1;
    uint8_t bit5 : 1;
    uint8_t bit6 : 1;
    uint8_t bit7 : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t bit7 : 1;
  uint8_t bit6 : 1;
  uint8_t bit5 : 1;
  uint8_t bit4 : 1;
  uint8_t bit3 : 1;
  uint8_t bit2 : 1;
  uint8_t bit1 : 1;
  uint8_t bit0 : 1;
#endif /* DRV_BYTE_ORDER */
  } lsm6dsm_sensorhub8_reg_t;

#define LSM6DSM_SENSORHUB9_REG 0x36U
  typedef struct
  {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
    uint8_t bit0 : 1;
    uint8_t bit1 : 1;
    uint8_t bit2 : 1;
    uint8_t bit3 : 1;
    uint8_t bit4 : 1;
    uint8_t bit5 : 1;
    uint8_t bit6 : 1;
    uint8_t bit7 : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t bit7 : 1;
  uint8_t bit6 : 1;
  uint8_t bit5 : 1;
  uint8_t bit4 : 1;
  uint8_t bit3 : 1;
  uint8_t bit2 : 1;
  uint8_t bit1 : 1;
  uint8_t bit0 : 1;
#endif /* DRV_BYTE_ORDER */
  } lsm6dsm_sensorhub9_reg_t;

#define LSM6DSM_SENSORHUB10_REG 0x37U
  typedef struct
  {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
    uint8_t bit0 : 1;
    uint8_t bit1 : 1;
    uint8_t bit2 : 1;
    uint8_t bit3 : 1;
    uint8_t bit4 : 1;
    uint8_t bit5 : 1;
    uint8_t bit6 : 1;
    uint8_t bit7 : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t bit7 : 1;
  uint8_t bit6 : 1;
  uint8_t bit5 : 1;
  uint8_t bit4 : 1;
  uint8_t bit3 : 1;
  uint8_t bit2 : 1;
  uint8_t bit1 : 1;
  uint8_t bit0 : 1;
#endif /* DRV_BYTE_ORDER */
  } lsm6dsm_sensorhub10_reg_t;

#define LSM6DSM_SENSORHUB11_REG 0x38U
  typedef struct
  {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
    uint8_t bit0 : 1;
    uint8_t bit1 : 1;
    uint8_t bit2 : 1;
    uint8_t bit3 : 1;
    uint8_t bit4 : 1;
    uint8_t bit5 : 1;
    uint8_t bit6 : 1;
    uint8_t bit7 : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t bit7 : 1;
  uint8_t bit6 : 1;
  uint8_t bit5 : 1;
  uint8_t bit4 : 1;
  uint8_t bit3 : 1;
  uint8_t bit2 : 1;
  uint8_t bit1 : 1;
  uint8_t bit0 : 1;
#endif /* DRV_BYTE_ORDER */
  } lsm6dsm_sensorhub11_reg_t;

#define LSM6DSM_SENSORHUB12_REG 0x39U
  typedef struct
  {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
    uint8_t bit0 : 1;
    uint8_t bit1 : 1;
    uint8_t bit2 : 1;
    uint8_t bit3 : 1;
    uint8_t bit4 : 1;
    uint8_t bit5 : 1;
    uint8_t bit6 : 1;
    uint8_t bit7 : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t bit7 : 1;
  uint8_t bit6 : 1;
  uint8_t bit5 : 1;
  uint8_t bit4 : 1;
  uint8_t bit3 : 1;
  uint8_t bit2 : 1;
  uint8_t bit1 : 1;
  uint8_t bit0 : 1;
#endif /* DRV_BYTE_ORDER */
  } lsm6dsm_sensorhub12_reg_t;

#define LSM6DSM_FIFO_STATUS1 0x3AU
  typedef struct
  {
    uint8_t diff_fifo : 8; /* + FIFO_STATUS2(diff_fifo) */
  } lsm6dsm_fifo_status1_t;

#define LSM6DSM_FIFO_STATUS2 0x3BU
  typedef struct
  {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
    uint8_t diff_fifo : 3; /* + FIFO_STATUS1(diff_fifo) */
    uint8_t not_used_01 : 1;
    uint8_t fifo_empty : 1;
    uint8_t fifo_full_smart : 1;
    uint8_t over_run : 1;
    uint8_t waterm : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t waterm : 1;
  uint8_t over_run : 1;
  uint8_t fifo_full_smart : 1;
  uint8_t fifo_empty : 1;
  uint8_t not_used_01 : 1;
  uint8_t diff_fifo : 3; /* + FIFO_STATUS1(diff_fifo) */
#endif /* DRV_BYTE_ORDER */
  } lsm6dsm_fifo_status2_t;

#define LSM6DSM_FIFO_STATUS3 0x3CU
  typedef struct
  {
    uint8_t fifo_pattern : 8; /* + FIFO_STATUS4(fifo_pattern) */
  } lsm6dsm_fifo_status3_t;

#define LSM6DSM_FIFO_STATUS4 0x3DU
  typedef struct
  {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
    uint8_t fifo_pattern : 2; /* + FIFO_STATUS3(fifo_pattern) */
    uint8_t not_used_01 : 6;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used_01 : 6;
  uint8_t fifo_pattern : 2; /* + FIFO_STATUS3(fifo_pattern) */
#endif /* DRV_BYTE_ORDER */
  } lsm6dsm_fifo_status4_t;

#define LSM6DSM_FIFO_DATA_OUT_L 0x3EU
#define LSM6DSM_FIFO_DATA_OUT_H 0x3FU
#define LSM6DSM_TIMESTAMP0_REG 0x40U
#define LSM6DSM_TIMESTAMP1_REG 0x41U
#define LSM6DSM_TIMESTAMP2_REG 0x42U
#define LSM6DSM_STEP_TIMESTAMP_L 0x49U
#define LSM6DSM_STEP_TIMESTAMP_H 0x4AU
#define LSM6DSM_STEP_COUNTER_L 0x4BU
#define LSM6DSM_STEP_COUNTER_H 0x4CU

#define LSM6DSM_SENSORHUB13_REG 0x4DU
  typedef struct
  {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
    uint8_t bit0 : 1;
    uint8_t bit1 : 1;
    uint8_t bit2 : 1;
    uint8_t bit3 : 1;
    uint8_t bit4 : 1;
    uint8_t bit5 : 1;
    uint8_t bit6 : 1;
    uint8_t bit7 : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t bit7 : 1;
  uint8_t bit6 : 1;
  uint8_t bit5 : 1;
  uint8_t bit4 : 1;
  uint8_t bit3 : 1;
  uint8_t bit2 : 1;
  uint8_t bit1 : 1;
  uint8_t bit0 : 1;
#endif /* DRV_BYTE_ORDER */
  } lsm6dsm_sensorhub13_reg_t;

#define LSM6DSM_SENSORHUB14_REG 0x4EU
  typedef struct
  {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
    uint8_t bit0 : 1;
    uint8_t bit1 : 1;
    uint8_t bit2 : 1;
    uint8_t bit3 : 1;
    uint8_t bit4 : 1;
    uint8_t bit5 : 1;
    uint8_t bit6 : 1;
    uint8_t bit7 : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t bit7 : 1;
  uint8_t bit6 : 1;
  uint8_t bit5 : 1;
  uint8_t bit4 : 1;
  uint8_t bit3 : 1;
  uint8_t bit2 : 1;
  uint8_t bit1 : 1;
  uint8_t bit0 : 1;
#endif /* DRV_BYTE_ORDER */
  } lsm6dsm_sensorhub14_reg_t;

#define LSM6DSM_SENSORHUB15_REG 0x4FU
  typedef struct
  {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
    uint8_t bit0 : 1;
    uint8_t bit1 : 1;
    uint8_t bit2 : 1;
    uint8_t bit3 : 1;
    uint8_t bit4 : 1;
    uint8_t bit5 : 1;
    uint8_t bit6 : 1;
    uint8_t bit7 : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t bit7 : 1;
  uint8_t bit6 : 1;
  uint8_t bit5 : 1;
  uint8_t bit4 : 1;
  uint8_t bit3 : 1;
  uint8_t bit2 : 1;
  uint8_t bit1 : 1;
  uint8_t bit0 : 1;
#endif /* DRV_BYTE_ORDER */
  } lsm6dsm_sensorhub15_reg_t;

#define LSM6DSM_SENSORHUB16_REG 0x50U
  typedef struct
  {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
    uint8_t bit0 : 1;
    uint8_t bit1 : 1;
    uint8_t bit2 : 1;
    uint8_t bit3 : 1;
    uint8_t bit4 : 1;
    uint8_t bit5 : 1;
    uint8_t bit6 : 1;
    uint8_t bit7 : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t bit7 : 1;
  uint8_t bit6 : 1;
  uint8_t bit5 : 1;
  uint8_t bit4 : 1;
  uint8_t bit3 : 1;
  uint8_t bit2 : 1;
  uint8_t bit1 : 1;
  uint8_t bit0 : 1;
#endif /* DRV_BYTE_ORDER */
  } lsm6dsm_sensorhub16_reg_t;

#define LSM6DSM_SENSORHUB17_REG 0x51U
  typedef struct
  {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
    uint8_t bit0 : 1;
    uint8_t bit1 : 1;
    uint8_t bit2 : 1;
    uint8_t bit3 : 1;
    uint8_t bit4 : 1;
    uint8_t bit5 : 1;
    uint8_t bit6 : 1;
    uint8_t bit7 : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t bit7 : 1;
  uint8_t bit6 : 1;
  uint8_t bit5 : 1;
  uint8_t bit4 : 1;
  uint8_t bit3 : 1;
  uint8_t bit2 : 1;
  uint8_t bit1 : 1;
  uint8_t bit0 : 1;
#endif /* DRV_BYTE_ORDER */
  } lsm6dsm_sensorhub17_reg_t;

#define LSM6DSM_SENSORHUB18_REG 0x52U
  typedef struct
  {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
    uint8_t bit0 : 1;
    uint8_t bit1 : 1;
    uint8_t bit2 : 1;
    uint8_t bit3 : 1;
    uint8_t bit4 : 1;
    uint8_t bit5 : 1;
    uint8_t bit6 : 1;
    uint8_t bit7 : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t bit7 : 1;
  uint8_t bit6 : 1;
  uint8_t bit5 : 1;
  uint8_t bit4 : 1;
  uint8_t bit3 : 1;
  uint8_t bit2 : 1;
  uint8_t bit1 : 1;
  uint8_t bit0 : 1;
#endif /* DRV_BYTE_ORDER */
  } lsm6dsm_sensorhub18_reg_t;

#define LSM6DSM_FUNC_SRC1 0x53U
  typedef struct
  {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
    uint8_t sensorhub_end_op : 1;
    uint8_t si_end_op : 1;
    uint8_t hi_fail : 1;
    uint8_t step_overflow : 1;
    uint8_t step_detected : 1;
    uint8_t tilt_ia : 1;
    uint8_t sign_motion_ia : 1;
    uint8_t step_count_delta_ia : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t step_count_delta_ia : 1;
  uint8_t sign_motion_ia : 1;
  uint8_t tilt_ia : 1;
  uint8_t step_detected : 1;
  uint8_t step_overflow : 1;
  uint8_t hi_fail : 1;
  uint8_t si_end_op : 1;
  uint8_t sensorhub_end_op : 1;
#endif /* DRV_BYTE_ORDER */
  } lsm6dsm_func_src1_t;

#define LSM6DSM_FUNC_SRC2 0x54U
  typedef struct
  {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
    uint8_t wrist_tilt_ia : 1;
    uint8_t not_used_01 : 2;
    uint8_t slave0_nack : 1;
    uint8_t slave1_nack : 1;
    uint8_t slave2_nack : 1;
    uint8_t slave3_nack : 1;
    uint8_t not_used_02 : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used_02 : 1;
  uint8_t slave3_nack : 1;
  uint8_t slave2_nack : 1;
  uint8_t slave1_nack : 1;
  uint8_t slave0_nack : 1;
  uint8_t not_used_01 : 2;
  uint8_t wrist_tilt_ia : 1;
#endif /* DRV_BYTE_ORDER */
  } lsm6dsm_func_src2_t;

#define LSM6DSM_WRIST_TILT_IA 0x55U
  typedef struct
  {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
    uint8_t not_used_01 : 2;
    uint8_t wrist_tilt_ia_zneg : 1;
    uint8_t wrist_tilt_ia_zpos : 1;
    uint8_t wrist_tilt_ia_yneg : 1;
    uint8_t wrist_tilt_ia_ypos : 1;
    uint8_t wrist_tilt_ia_xneg : 1;
    uint8_t wrist_tilt_ia_xpos : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t wrist_tilt_ia_xpos : 1;
  uint8_t wrist_tilt_ia_xneg : 1;
  uint8_t wrist_tilt_ia_ypos : 1;
  uint8_t wrist_tilt_ia_yneg : 1;
  uint8_t wrist_tilt_ia_zpos : 1;
  uint8_t wrist_tilt_ia_zneg : 1;
  uint8_t not_used_01 : 2;
#endif /* DRV_BYTE_ORDER */
  } lsm6dsm_wrist_tilt_ia_t;

#define LSM6DSM_TAP_CFG 0x58U
  typedef struct
  {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
    uint8_t lir : 1;
    uint8_t tap_z_en : 1;
    uint8_t tap_y_en : 1;
    uint8_t tap_x_en : 1;
    uint8_t slope_fds : 1;
    uint8_t inact_en : 2;
    uint8_t interrupts_enable : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t interrupts_enable : 1;
  uint8_t inact_en : 2;
  uint8_t slope_fds : 1;
  uint8_t tap_x_en : 1;
  uint8_t tap_y_en : 1;
  uint8_t tap_z_en : 1;
  uint8_t lir : 1;
#endif /* DRV_BYTE_ORDER */
  } lsm6dsm_tap_cfg_t;

#define LSM6DSM_TAP_THS_6D 0x59U
  typedef struct
  {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
    uint8_t tap_ths : 5;
    uint8_t sixd_ths : 2;
    uint8_t d4d_en : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t d4d_en : 1;
  uint8_t sixd_ths : 2;
  uint8_t tap_ths : 5;
#endif /* DRV_BYTE_ORDER */
  } lsm6dsm_tap_ths_6d_t;

