liuhuaxijun/pro07_STM32F405RGT6_bike/Int/lsm6dsm_reg.h
#define LSM6DSM_INT_DUR2 0x5AU
  typedef struct
  {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
    uint8_t shock : 2;
    uint8_t quiet : 2;
    uint8_t dur : 4;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t dur : 4;
  uint8_t quiet : 2;
  uint8_t shock : 2;
#endif /* DRV_BYTE_ORDER */
  } lsm6dsm_int_dur2_t;

#define LSM6DSM_WAKE_UP_THS 0x5BU
  typedef struct
  {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
    uint8_t wk_ths : 6;
    uint8_t not_used_01 : 1;
    uint8_t single_double_tap : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t single_double_tap : 1;
  uint8_t not_used_01 : 1;
  uint8_t wk_ths : 6;
#endif /* DRV_BYTE_ORDER */
  } lsm6dsm_wake_up_ths_t;

#define LSM6DSM_WAKE_UP_DUR 0x5CU
  typedef struct
  {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
    uint8_t sleep_dur : 4;
    uint8_t timer_hr : 1;
    uint8_t wake_dur : 2;
    uint8_t ff_dur : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t ff_dur : 1;
  uint8_t wake_dur : 2;
  uint8_t timer_hr : 1;
  uint8_t sleep_dur : 4;
#endif /* DRV_BYTE_ORDER */
  } lsm6dsm_wake_up_dur_t;

#define LSM6DSM_FREE_FALL 0x5DU
  typedef struct
  {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
    uint8_t ff_ths : 3;
    uint8_t ff_dur : 5;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t ff_dur : 5;
  uint8_t ff_ths : 3;
#endif /* DRV_BYTE_ORDER */
  } lsm6dsm_free_fall_t;

#define LSM6DSM_MD1_CFG 0x5EU
  typedef struct
  {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
    uint8_t int1_timer : 1;
    uint8_t int1_tilt : 1;
    uint8_t int1_6d : 1;
    uint8_t int1_double_tap : 1;
    uint8_t int1_ff : 1;
    uint8_t int1_wu : 1;
    uint8_t int1_single_tap : 1;
    uint8_t int1_inact_state : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t int1_inact_state : 1;
  uint8_t int1_single_tap : 1;
  uint8_t int1_wu : 1;
  uint8_t int1_ff : 1;
  uint8_t int1_double_tap : 1;
  uint8_t int1_6d : 1;
  uint8_t int1_tilt : 1;
  uint8_t int1_timer : 1;
#endif /* DRV_BYTE_ORDER */
  } lsm6dsm_md1_cfg_t;

#define LSM6DSM_MD2_CFG 0x5FU
  typedef struct
  {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
    uint8_t int2_iron : 1;
    uint8_t int2_tilt : 1;
    uint8_t int2_6d : 1;
    uint8_t int2_double_tap : 1;
    uint8_t int2_ff : 1;
    uint8_t int2_wu : 1;
    uint8_t int2_single_tap : 1;
    uint8_t int2_inact_state : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t int2_inact_state : 1;
  uint8_t int2_single_tap : 1;
  uint8_t int2_wu : 1;
  uint8_t int2_ff : 1;
  uint8_t int2_double_tap : 1;
  uint8_t int2_6d : 1;
  uint8_t int2_tilt : 1;
  uint8_t int2_iron : 1;
#endif /* DRV_BYTE_ORDER */
  } lsm6dsm_md2_cfg_t;

#define LSM6DSM_MASTER_CMD_CODE 0x60U
  typedef struct
  {
    uint8_t master_cmd_code : 8;
  } lsm6dsm_master_cmd_code_t;

#define LSM6DSM_SENS_SYNC_SPI_ERROR_CODE 0x61U
  typedef struct
  {
    uint8_t error_code : 8;
  } lsm6dsm_sens_sync_spi_error_code_t;

#define LSM6DSM_OUT_MAG_RAW_X_L 0x66U
#define LSM6DSM_OUT_MAG_RAW_X_H 0x67U
#define LSM6DSM_OUT_MAG_RAW_Y_L 0x68U
#define LSM6DSM_OUT_MAG_RAW_Y_H 0x69U
#define LSM6DSM_OUT_MAG_RAW_Z_L 0x6AU
#define LSM6DSM_OUT_MAG_RAW_Z_H 0x6BU
#define LSM6DSM_INT_OIS 0x6FU
  typedef struct
  {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
    uint8_t not_used_01 : 6;
    uint8_t lvl2_ois : 1;
    uint8_t int2_drdy_ois : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t int2_drdy_ois : 1;
  uint8_t lvl2_ois : 1;
  uint8_t not_used_01 : 6;
#endif /* DRV_BYTE_ORDER */
  } lsm6dsm_int_ois_t;

#define LSM6DSM_CTRL1_OIS 0x70U
  typedef struct
  {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
    uint8_t ois_en_spi2 : 1;
    uint8_t fs_g_ois : 3; /* fs_g_ois + fs_125_ois */
    uint8_t mode4_en : 1;
    uint8_t sim_ois : 1;
    uint8_t lvl1_ois : 1;
    uint8_t ble_ois : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t ble_ois : 1;
  uint8_t lvl1_ois : 1;
  uint8_t sim_ois : 1;
  uint8_t mode4_en : 1;
  uint8_t fs_g_ois : 3; /* fs_g_ois + fs_125_ois */
  uint8_t ois_en_spi2 : 1;
#endif /* DRV_BYTE_ORDER */
  } lsm6dsm_ctrl1_ois_t;

#define LSM6DSM_CTRL2_OIS 0x71U
  typedef struct
  {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
    uint8_t hp_en_ois : 1;
    uint8_t ftype_ois : 2;
    uint8_t not_used_01 : 1;
    uint8_t hpm_ois : 2;
    uint8_t not_used_02 : 2;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used_02 : 2;
  uint8_t hpm_ois : 2;
  uint8_t not_used_01 : 1;
  uint8_t ftype_ois : 2;
  uint8_t hp_en_ois : 1;
#endif /* DRV_BYTE_ORDER */
  } lsm6dsm_ctrl2_ois_t;

#define LSM6DSM_CTRL3_OIS 0x72U
  typedef struct
  {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
    uint8_t st_ois_clampdis : 1;
    uint8_t st_ois : 2;
    uint8_t filter_xl_conf_ois : 2;
    uint8_t fs_xl_ois : 2;
    uint8_t den_lh_ois : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t den_lh_ois : 1;
  uint8_t fs_xl_ois : 2;
  uint8_t filter_xl_conf_ois : 2;
  uint8_t st_ois : 2;
  uint8_t st_ois_clampdis : 1;
#endif /* DRV_BYTE_ORDER */
  } lsm6dsm_ctrl3_ois_t;

#define LSM6DSM_X_OFS_USR 0x73U
#define LSM6DSM_Y_OFS_USR 0x74U
#define LSM6DSM_Z_OFS_USR 0x75U
#define LSM6DSM_SLV0_ADD 0x02U
  typedef struct
  {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
    uint8_t rw_0 : 1;
    uint8_t slave0_add : 7;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t slave0_add : 7;
  uint8_t rw_0 : 1;
#endif /* DRV_BYTE_ORDER */
  } lsm6dsm_slv0_add_t;

#define LSM6DSM_SLV0_SUBADD 0x03U
  typedef struct
  {
    uint8_t slave0_reg : 8;
  } lsm6dsm_slv0_subadd_t;

#define LSM6DSM_SLAVE0_CONFIG 0x04U
  typedef struct
  {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
    uint8_t slave0_numop : 3;
    uint8_t src_mode : 1;
    uint8_t aux_sens_on : 2;
    uint8_t slave0_rate : 2;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t slave0_rate : 2;
  uint8_t aux_sens_on : 2;
  uint8_t src_mode : 1;
  uint8_t slave0_numop : 3;
#endif /* DRV_BYTE_ORDER */
  } lsm6dsm_slave0_config_t;

#define LSM6DSM_SLV1_ADD 0x05U
  typedef struct
  {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
    uint8_t r_1 : 1;
    uint8_t slave1_add : 7;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t slave1_add : 7;
  uint8_t r_1 : 1;
#endif /* DRV_BYTE_ORDER */
  } lsm6dsm_slv1_add_t;

