liuhuaxijun/pro07_STM32F405RGT6_bike/Int/lsm6dsm_reg.h
  /*
   * These are the basic platform dependent I/O routines to read
   * and write device registers connected on a standard bus.
   * The driver keeps offering a default implementation based on function
   * pointers to read/write routines for backward compatibility.
   * The __weak directive allows the final application to overwrite
   * them with a custom implementation.
   */

  int32_t lsm6dsm_read_reg(const stmdev_ctx_t *ctx, uint8_t reg,
                           uint8_t *data,
                           uint16_t len);
  int32_t lsm6dsm_write_reg(const stmdev_ctx_t *ctx, uint8_t reg,
                            uint8_t *data,
                            uint16_t len);

  float_t lsm6dsm_from_fs2g_to_mg(int16_t lsb);
  float_t lsm6dsm_from_fs4g_to_mg(int16_t lsb);
  float_t lsm6dsm_from_fs8g_to_mg(int16_t lsb);
  float_t lsm6dsm_from_fs16g_to_mg(int16_t lsb);

  float_t lsm6dsm_from_fs125dps_to_mdps(int16_t lsb);
  float_t lsm6dsm_from_fs250dps_to_mdps(int16_t lsb);
  float_t lsm6dsm_from_fs500dps_to_mdps(int16_t lsb);
  float_t lsm6dsm_from_fs1000dps_to_mdps(int16_t lsb);
  float_t lsm6dsm_from_fs2000dps_to_mdps(int16_t lsb);

  float_t lsm6dsm_from_lsb_to_celsius(int16_t lsb);

  typedef enum
  {
    LSM6DSM_2g = 0,
    LSM6DSM_16g = 1,
    LSM6DSM_4g = 2,
    LSM6DSM_8g = 3,
  } lsm6dsm_fs_xl_t;
  int32_t lsm6dsm_xl_full_scale_set(const stmdev_ctx_t *ctx,
                                    lsm6dsm_fs_xl_t val);
  int32_t lsm6dsm_xl_full_scale_get(const stmdev_ctx_t *ctx,
                                    lsm6dsm_fs_xl_t *val);

  typedef enum
  {
    LSM6DSM_XL_ODR_OFF = 0,
    LSM6DSM_XL_ODR_12Hz5 = 1,
    LSM6DSM_XL_ODR_26Hz = 2,
    LSM6DSM_XL_ODR_52Hz = 3,
    LSM6DSM_XL_ODR_104Hz = 4,
    LSM6DSM_XL_ODR_208Hz = 5,
    LSM6DSM_XL_ODR_416Hz = 6,
    LSM6DSM_XL_ODR_833Hz = 7,
    LSM6DSM_XL_ODR_1k66Hz = 8,
    LSM6DSM_XL_ODR_3k33Hz = 9,
    LSM6DSM_XL_ODR_6k66Hz = 10,
    LSM6DSM_XL_ODR_1Hz6 = 11,
  } lsm6dsm_odr_xl_t;
  int32_t lsm6dsm_xl_data_rate_set(const stmdev_ctx_t *ctx,
                                   lsm6dsm_odr_xl_t val);
  int32_t lsm6dsm_xl_data_rate_get(const stmdev_ctx_t *ctx,
                                   lsm6dsm_odr_xl_t *val);

  typedef enum
  {
    LSM6DSM_250dps = 0,
    LSM6DSM_125dps = 1,
    LSM6DSM_500dps = 2,
    LSM6DSM_1000dps = 4,
    LSM6DSM_2000dps = 6,
  } lsm6dsm_fs_g_t;
  int32_t lsm6dsm_gy_full_scale_set(const stmdev_ctx_t *ctx,
                                    lsm6dsm_fs_g_t val);
  int32_t lsm6dsm_gy_full_scale_get(const stmdev_ctx_t *ctx,
                                    lsm6dsm_fs_g_t *val);

  typedef enum
  {
    LSM6DSM_GY_ODR_OFF = 0,
    LSM6DSM_GY_ODR_12Hz5 = 1,
    LSM6DSM_GY_ODR_26Hz = 2,
    LSM6DSM_GY_ODR_52Hz = 3,
    LSM6DSM_GY_ODR_104Hz = 4,
    LSM6DSM_GY_ODR_208Hz = 5,
    LSM6DSM_GY_ODR_416Hz = 6,
    LSM6DSM_GY_ODR_833Hz = 7,
    LSM6DSM_GY_ODR_1k66Hz = 8,
    LSM6DSM_GY_ODR_3k33Hz = 9,
    LSM6DSM_GY_ODR_6k66Hz = 10,
  } lsm6dsm_odr_g_t;
  int32_t lsm6dsm_gy_data_rate_set(const stmdev_ctx_t *ctx,
                                   lsm6dsm_odr_g_t val);
  int32_t lsm6dsm_gy_data_rate_get(const stmdev_ctx_t *ctx,
                                   lsm6dsm_odr_g_t *val);

  int32_t lsm6dsm_block_data_update_set(const stmdev_ctx_t *ctx, uint8_t val);
  int32_t lsm6dsm_block_data_update_get(const stmdev_ctx_t *ctx,
                                        uint8_t *val);

  typedef enum
  {
    LSM6DSM_LSb_1mg = 0,
    LSM6DSM_LSb_16mg = 1,
  } lsm6dsm_usr_off_w_t;
  int32_t lsm6dsm_xl_offset_weight_set(const stmdev_ctx_t *ctx,
                                       lsm6dsm_usr_off_w_t val);
  int32_t lsm6dsm_xl_offset_weight_get(const stmdev_ctx_t *ctx,
                                       lsm6dsm_usr_off_w_t *val);

  typedef enum
  {
    LSM6DSM_XL_HIGH_PERFORMANCE = 0,
    LSM6DSM_XL_NORMAL = 1,
  } lsm6dsm_xl_hm_mode_t;
  int32_t lsm6dsm_xl_power_mode_set(const stmdev_ctx_t *ctx,
                                    lsm6dsm_xl_hm_mode_t val);
  int32_t lsm6dsm_xl_power_mode_get(const stmdev_ctx_t *ctx,
                                    lsm6dsm_xl_hm_mode_t *val);

  typedef enum
  {
    LSM6DSM_STAT_RND_DISABLE = 0,
    LSM6DSM_STAT_RND_ENABLE = 1,
  } lsm6dsm_rounding_status_t;
  int32_t lsm6dsm_rounding_on_status_set(const stmdev_ctx_t *ctx,
                                         lsm6dsm_rounding_status_t val);
  int32_t lsm6dsm_rounding_on_status_get(const stmdev_ctx_t *ctx,
                                         lsm6dsm_rounding_status_t *val);

  typedef enum
  {
    LSM6DSM_GY_HIGH_PERFORMANCE = 0,
    LSM6DSM_GY_NORMAL = 1,
  } lsm6dsm_g_hm_mode_t;
  int32_t lsm6dsm_gy_power_mode_set(const stmdev_ctx_t *ctx,
                                    lsm6dsm_g_hm_mode_t val);
  int32_t lsm6dsm_gy_power_mode_get(const stmdev_ctx_t *ctx,
                                    lsm6dsm_g_hm_mode_t *val);

  typedef struct
  {
    lsm6dsm_wake_up_src_t wake_up_src;
    lsm6dsm_tap_src_t tap_src;
    lsm6dsm_d6d_src_t d6d_src;
    lsm6dsm_status_reg_t status_reg;
    lsm6dsm_func_src1_t func_src1;
    lsm6dsm_func_src2_t func_src2;
    lsm6dsm_wrist_tilt_ia_t wrist_tilt_ia;
    lsm6dsm_a_wrist_tilt_mask_t a_wrist_tilt_mask;
  } lsm6dsm_all_sources_t;
  int32_t lsm6dsm_all_sources_get(const stmdev_ctx_t *ctx,
                                  lsm6dsm_all_sources_t *val);

  int32_t lsm6dsm_status_reg_get(const stmdev_ctx_t *ctx,
                                 lsm6dsm_status_reg_t *val);

  int32_t lsm6dsm_xl_flag_data_ready_get(const stmdev_ctx_t *ctx,
                                         uint8_t *val);

  int32_t lsm6dsm_gy_flag_data_ready_get(const stmdev_ctx_t *ctx,
                                         uint8_t *val);

  int32_t lsm6dsm_temp_flag_data_ready_get(const stmdev_ctx_t *ctx,
                                           uint8_t *val);

  int32_t lsm6dsm_xl_usr_offset_set(const stmdev_ctx_t *ctx, uint8_t *buff);
  int32_t lsm6dsm_xl_usr_offset_get(const stmdev_ctx_t *ctx, uint8_t *buff);
  int32_t lsm6dsm_timestamp_set(const stmdev_ctx_t *ctx, uint8_t val);
  int32_t lsm6dsm_timestamp_get(const stmdev_ctx_t *ctx, uint8_t *val);

