liuhuaxijun/pro07_STM32F405RGT6_bike/Int/lsm6dsm_reg.h
  typedef enum
  {
    LSM6DSM_LSB_6ms4 = 0,
    LSM6DSM_LSB_25us = 1,
  } lsm6dsm_timer_hr_t;
  int32_t lsm6dsm_timestamp_res_set(const stmdev_ctx_t *ctx,
                                    lsm6dsm_timer_hr_t val);
  int32_t lsm6dsm_timestamp_res_get(const stmdev_ctx_t *ctx,
                                    lsm6dsm_timer_hr_t *val);

  typedef enum
  {
    LSM6DSM_ROUND_DISABLE = 0,
    LSM6DSM_ROUND_XL = 1,
    LSM6DSM_ROUND_GY = 2,
    LSM6DSM_ROUND_GY_XL = 3,
    LSM6DSM_ROUND_SH1_TO_SH6 = 4,
    LSM6DSM_ROUND_XL_SH1_TO_SH6 = 5,
    LSM6DSM_ROUND_GY_XL_SH1_TO_SH12 = 6,
    LSM6DSM_ROUND_GY_XL_SH1_TO_SH6 = 7,
  } lsm6dsm_rounding_t;
  int32_t lsm6dsm_rounding_mode_set(const stmdev_ctx_t *ctx,
                                    lsm6dsm_rounding_t val);
  int32_t lsm6dsm_rounding_mode_get(const stmdev_ctx_t *ctx,
                                    lsm6dsm_rounding_t *val);

  int32_t lsm6dsm_temperature_raw_get(const stmdev_ctx_t *ctx, int16_t *val);
  int32_t lsm6dsm_angular_rate_raw_get(const stmdev_ctx_t *ctx, int16_t *val);
  int32_t lsm6dsm_acceleration_raw_get(const stmdev_ctx_t *ctx, int16_t *val);

  int32_t lsm6dsm_mag_calibrated_raw_get(const stmdev_ctx_t *ctx,
                                         int16_t *val);

  int32_t lsm6dsm_fifo_raw_data_get(const stmdev_ctx_t *ctx, uint8_t *buffer,
                                    uint8_t len);

  typedef enum
  {
    LSM6DSM_USER_BANK = 0,
    LSM6DSM_BANK_A = 4,
    LSM6DSM_BANK_B = 5,
  } lsm6dsm_func_cfg_en_t;
  int32_t lsm6dsm_mem_bank_set(const stmdev_ctx_t *ctx,
                               lsm6dsm_func_cfg_en_t val);
  int32_t lsm6dsm_mem_bank_get(const stmdev_ctx_t *ctx,
                               lsm6dsm_func_cfg_en_t *val);

  typedef enum
  {
    LSM6DSM_DRDY_LATCHED = 0,
    LSM6DSM_DRDY_PULSED = 1,
  } lsm6dsm_drdy_pulsed_g_t;
  int32_t lsm6dsm_data_ready_mode_set(const stmdev_ctx_t *ctx,
                                      lsm6dsm_drdy_pulsed_g_t val);
  int32_t lsm6dsm_data_ready_mode_get(const stmdev_ctx_t *ctx,
                                      lsm6dsm_drdy_pulsed_g_t *val);

  int32_t lsm6dsm_device_id_get(const stmdev_ctx_t *ctx, uint8_t *buff);
  int32_t lsm6dsm_reset_set(const stmdev_ctx_t *ctx, uint8_t val);
  int32_t lsm6dsm_reset_get(const stmdev_ctx_t *ctx, uint8_t *val);

  typedef enum
  {
    LSM6DSM_LSB_AT_LOW_ADD = 0,
    LSM6DSM_MSB_AT_LOW_ADD = 1,
  } lsm6dsm_ble_t;
  int32_t lsm6dsm_data_format_set(const stmdev_ctx_t *ctx, lsm6dsm_ble_t val);
  int32_t lsm6dsm_data_format_get(const stmdev_ctx_t *ctx,
                                  lsm6dsm_ble_t *val);

  int32_t lsm6dsm_auto_increment_set(const stmdev_ctx_t *ctx, uint8_t val);
  int32_t lsm6dsm_auto_increment_get(const stmdev_ctx_t *ctx, uint8_t *val);

  int32_t lsm6dsm_boot_set(const stmdev_ctx_t *ctx, uint8_t val);
  int32_t lsm6dsm_boot_get(const stmdev_ctx_t *ctx, uint8_t *val);

  typedef enum
  {
    LSM6DSM_XL_ST_DISABLE = 0,
    LSM6DSM_XL_ST_POSITIVE = 1,
    LSM6DSM_XL_ST_NEGATIVE = 2,
  } lsm6dsm_st_xl_t;
  int32_t lsm6dsm_xl_self_test_set(const stmdev_ctx_t *ctx,
                                   lsm6dsm_st_xl_t val);
  int32_t lsm6dsm_xl_self_test_get(const stmdev_ctx_t *ctx,
                                   lsm6dsm_st_xl_t *val);

  typedef enum
  {
    LSM6DSM_GY_ST_DISABLE = 0,
    LSM6DSM_GY_ST_POSITIVE = 1,
    LSM6DSM_GY_ST_NEGATIVE = 3,
  } lsm6dsm_st_g_t;
  int32_t lsm6dsm_gy_self_test_set(const stmdev_ctx_t *ctx,
                                   lsm6dsm_st_g_t val);
  int32_t lsm6dsm_gy_self_test_get(const stmdev_ctx_t *ctx,
                                   lsm6dsm_st_g_t *val);

  int32_t lsm6dsm_filter_settling_mask_set(const stmdev_ctx_t *ctx,
                                           uint8_t val);
  int32_t lsm6dsm_filter_settling_mask_get(const stmdev_ctx_t *ctx,
                                           uint8_t *val);

  typedef enum
  {
    LSM6DSM_USE_SLOPE = 0,
    LSM6DSM_USE_HPF = 1,
  } lsm6dsm_slope_fds_t;
  int32_t lsm6dsm_xl_hp_path_internal_set(const stmdev_ctx_t *ctx,
                                          lsm6dsm_slope_fds_t val);
  int32_t lsm6dsm_xl_hp_path_internal_get(const stmdev_ctx_t *ctx,
                                          lsm6dsm_slope_fds_t *val);

  typedef enum
  {
    LSM6DSM_XL_ANA_BW_1k5Hz = 0,
    LSM6DSM_XL_ANA_BW_400Hz = 1,
  } lsm6dsm_bw0_xl_t;
  int32_t lsm6dsm_xl_filter_analog_set(const stmdev_ctx_t *ctx,
                                       lsm6dsm_bw0_xl_t val);
  int32_t lsm6dsm_xl_filter_analog_get(const stmdev_ctx_t *ctx,
                                       lsm6dsm_bw0_xl_t *val);

  typedef enum
  {
    LSM6DSM_XL_LP1_ODR_DIV_2 = 0,
    LSM6DSM_XL_LP1_ODR_DIV_4 = 1,
    LSM6DSM_XL_LP1_NA = 2, /* ERROR CODE */
  } lsm6dsm_lpf1_bw_sel_t;
  int32_t lsm6dsm_xl_lp1_bandwidth_set(const stmdev_ctx_t *ctx,
                                       lsm6dsm_lpf1_bw_sel_t val);
  int32_t lsm6dsm_xl_lp1_bandwidth_get(const stmdev_ctx_t *ctx,
                                       lsm6dsm_lpf1_bw_sel_t *val);

  typedef enum
  {
    LSM6DSM_XL_LOW_LAT_LP_ODR_DIV_50 = 0x00,
    LSM6DSM_XL_LOW_LAT_LP_ODR_DIV_100 = 0x01,
    LSM6DSM_XL_LOW_LAT_LP_ODR_DIV_9 = 0x02,
    LSM6DSM_XL_LOW_LAT_LP_ODR_DIV_400 = 0x03,
    LSM6DSM_XL_LOW_NOISE_LP_ODR_DIV_50 = 0x10,
    LSM6DSM_XL_LOW_NOISE_LP_ODR_DIV_100 = 0x11,
    LSM6DSM_XL_LOW_NOISE_LP_ODR_DIV_9 = 0x12,
    LSM6DSM_XL_LOW_NOISE_LP_ODR_DIV_400 = 0x13,
    LSM6DSM_XL_LP_NA = 0x20, /* ERROR CODE */
  } lsm6dsm_input_composite_t;
  int32_t lsm6dsm_xl_lp2_bandwidth_set(const stmdev_ctx_t *ctx,
                                       lsm6dsm_input_composite_t val);
  int32_t lsm6dsm_xl_lp2_bandwidth_get(const stmdev_ctx_t *ctx,
                                       lsm6dsm_input_composite_t *val);

  int32_t lsm6dsm_xl_reference_mode_set(const stmdev_ctx_t *ctx, uint8_t val);
  int32_t lsm6dsm_xl_reference_mode_get(const stmdev_ctx_t *ctx,
                                        uint8_t *val);

  typedef enum
  {
    LSM6DSM_XL_HP_ODR_DIV_4 = 0x00, /* Slope filter */
    LSM6DSM_XL_HP_ODR_DIV_100 = 0x01,
    LSM6DSM_XL_HP_ODR_DIV_9 = 0x02,
    LSM6DSM_XL_HP_ODR_DIV_400 = 0x03,
    LSM6DSM_XL_HP_NA = 0x10, /* ERROR CODE */
  } lsm6dsm_hpcf_xl_t;
  int32_t lsm6dsm_xl_hp_bandwidth_set(const stmdev_ctx_t *ctx,
                                      lsm6dsm_hpcf_xl_t val);
  int32_t lsm6dsm_xl_hp_bandwidth_get(const stmdev_ctx_t *ctx,
                                      lsm6dsm_hpcf_xl_t *val);

