liuhuaxijun/pro07_STM32F405RGT6_bike/Int/lsm6dsm_reg.h
  int32_t lsm6dsm_tap_dur_set(const stmdev_ctx_t *ctx, uint8_t val);
  int32_t lsm6dsm_tap_dur_get(const stmdev_ctx_t *ctx, uint8_t *val);

  typedef enum
  {
    LSM6DSM_ONLY_SINGLE = 0,
    LSM6DSM_BOTH_SINGLE_DOUBLE = 1,
  } lsm6dsm_single_double_tap_t;
  int32_t lsm6dsm_tap_mode_set(const stmdev_ctx_t *ctx,
                               lsm6dsm_single_double_tap_t val);
  int32_t lsm6dsm_tap_mode_get(const stmdev_ctx_t *ctx,
                               lsm6dsm_single_double_tap_t *val);

  typedef enum
  {
    LSM6DSM_ODR_DIV_2_FEED = 0,
    LSM6DSM_LPF2_FEED = 1,
  } lsm6dsm_low_pass_on_6d_t;
  int32_t lsm6dsm_6d_feed_data_set(const stmdev_ctx_t *ctx,
                                   lsm6dsm_low_pass_on_6d_t val);
  int32_t lsm6dsm_6d_feed_data_get(const stmdev_ctx_t *ctx,
                                   lsm6dsm_low_pass_on_6d_t *val);

  typedef enum
  {
    LSM6DSM_DEG_80 = 0,
    LSM6DSM_DEG_70 = 1,
    LSM6DSM_DEG_60 = 2,
    LSM6DSM_DEG_50 = 3,
  } lsm6dsm_sixd_ths_t;
  int32_t lsm6dsm_6d_threshold_set(const stmdev_ctx_t *ctx,
                                   lsm6dsm_sixd_ths_t val);
  int32_t lsm6dsm_6d_threshold_get(const stmdev_ctx_t *ctx,
                                   lsm6dsm_sixd_ths_t *val);

  int32_t lsm6dsm_4d_mode_set(const stmdev_ctx_t *ctx, uint8_t val);
  int32_t lsm6dsm_4d_mode_get(const stmdev_ctx_t *ctx, uint8_t *val);

  int32_t lsm6dsm_ff_dur_set(const stmdev_ctx_t *ctx, uint8_t val);
  int32_t lsm6dsm_ff_dur_get(const stmdev_ctx_t *ctx, uint8_t *val);

  typedef enum
  {
    LSM6DSM_FF_TSH_156mg = 0,
    LSM6DSM_FF_TSH_219mg = 1,
    LSM6DSM_FF_TSH_250mg = 2,
    LSM6DSM_FF_TSH_312mg = 3,
    LSM6DSM_FF_TSH_344mg = 4,
    LSM6DSM_FF_TSH_406mg = 5,
    LSM6DSM_FF_TSH_469mg = 6,
    LSM6DSM_FF_TSH_500mg = 7,
  } lsm6dsm_ff_ths_t;
  int32_t lsm6dsm_ff_threshold_set(const stmdev_ctx_t *ctx,
                                   lsm6dsm_ff_ths_t val);
  int32_t lsm6dsm_ff_threshold_get(const stmdev_ctx_t *ctx,
                                   lsm6dsm_ff_ths_t *val);

  int32_t lsm6dsm_fifo_watermark_set(const stmdev_ctx_t *ctx, uint16_t val);
  int32_t lsm6dsm_fifo_watermark_get(const stmdev_ctx_t *ctx, uint16_t *val);

  int32_t lsm6dsm_fifo_data_level_get(const stmdev_ctx_t *ctx, uint16_t *val);

  int32_t lsm6dsm_fifo_wtm_flag_get(const stmdev_ctx_t *ctx, uint8_t *val);
  int32_t lsm6dsm_fifo_over_run_get(const stmdev_ctx_t *ctx, uint8_t *val);

  int32_t lsm6dsm_fifo_pattern_get(const stmdev_ctx_t *ctx, uint16_t *val);

  int32_t lsm6dsm_fifo_temp_batch_set(const stmdev_ctx_t *ctx, uint8_t val);
  int32_t lsm6dsm_fifo_temp_batch_get(const stmdev_ctx_t *ctx, uint8_t *val);

  typedef enum
  {
    LSM6DSM_TRG_XL_GY_DRDY = 0,
    LSM6DSM_TRG_STEP_DETECT = 1,
    LSM6DSM_TRG_SH_DRDY = 2,
  } lsm6dsm_trigger_fifo_t;
  int32_t lsm6dsm_fifo_write_trigger_set(const stmdev_ctx_t *ctx,
                                         lsm6dsm_trigger_fifo_t val);
  int32_t lsm6dsm_fifo_write_trigger_get(const stmdev_ctx_t *ctx,
                                         lsm6dsm_trigger_fifo_t *val);

  int32_t lsm6dsm_fifo_pedo_and_timestamp_batch_set(const stmdev_ctx_t *ctx,
                                                    uint8_t val);
  int32_t lsm6dsm_fifo_pedo_and_timestamp_batch_get(const stmdev_ctx_t *ctx,
                                                    uint8_t *val);

  typedef enum
  {
    LSM6DSM_FIFO_XL_DISABLE = 0,
    LSM6DSM_FIFO_XL_NO_DEC = 1,
    LSM6DSM_FIFO_XL_DEC_2 = 2,
    LSM6DSM_FIFO_XL_DEC_3 = 3,
    LSM6DSM_FIFO_XL_DEC_4 = 4,
    LSM6DSM_FIFO_XL_DEC_8 = 5,
    LSM6DSM_FIFO_XL_DEC_16 = 6,
    LSM6DSM_FIFO_XL_DEC_32 = 7,
  } lsm6dsm_dec_fifo_xl_t;
  int32_t lsm6dsm_fifo_xl_batch_set(const stmdev_ctx_t *ctx,
                                    lsm6dsm_dec_fifo_xl_t val);
  int32_t lsm6dsm_fifo_xl_batch_get(const stmdev_ctx_t *ctx,
                                    lsm6dsm_dec_fifo_xl_t *val);

  typedef enum
  {
    LSM6DSM_FIFO_GY_DISABLE = 0,
    LSM6DSM_FIFO_GY_NO_DEC = 1,
    LSM6DSM_FIFO_GY_DEC_2 = 2,
    LSM6DSM_FIFO_GY_DEC_3 = 3,
    LSM6DSM_FIFO_GY_DEC_4 = 4,
    LSM6DSM_FIFO_GY_DEC_8 = 5,
    LSM6DSM_FIFO_GY_DEC_16 = 6,
    LSM6DSM_FIFO_GY_DEC_32 = 7,
  } lsm6dsm_dec_fifo_gyro_t;
  int32_t lsm6dsm_fifo_gy_batch_set(const stmdev_ctx_t *ctx,
                                    lsm6dsm_dec_fifo_gyro_t val);
  int32_t lsm6dsm_fifo_gy_batch_get(const stmdev_ctx_t *ctx,
                                    lsm6dsm_dec_fifo_gyro_t *val);

  typedef enum
  {
    LSM6DSM_FIFO_DS3_DISABLE = 0,
    LSM6DSM_FIFO_DS3_NO_DEC = 1,
    LSM6DSM_FIFO_DS3_DEC_2 = 2,
    LSM6DSM_FIFO_DS3_DEC_3 = 3,
    LSM6DSM_FIFO_DS3_DEC_4 = 4,
    LSM6DSM_FIFO_DS3_DEC_8 = 5,
    LSM6DSM_FIFO_DS3_DEC_16 = 6,
    LSM6DSM_FIFO_DS3_DEC_32 = 7,
  } lsm6dsm_dec_ds3_fifo_t;
  int32_t lsm6dsm_fifo_dataset_3_batch_set(const stmdev_ctx_t *ctx,
                                           lsm6dsm_dec_ds3_fifo_t val);
  int32_t lsm6dsm_fifo_dataset_3_batch_get(const stmdev_ctx_t *ctx,
                                           lsm6dsm_dec_ds3_fifo_t *val);

  typedef enum
  {
    LSM6DSM_FIFO_DS4_DISABLE = 0,
    LSM6DSM_FIFO_DS4_NO_DEC = 1,
    LSM6DSM_FIFO_DS4_DEC_2 = 2,
    LSM6DSM_FIFO_DS4_DEC_3 = 3,
    LSM6DSM_FIFO_DS4_DEC_4 = 4,
    LSM6DSM_FIFO_DS4_DEC_8 = 5,
    LSM6DSM_FIFO_DS4_DEC_16 = 6,
    LSM6DSM_FIFO_DS4_DEC_32 = 7,
  } lsm6dsm_dec_ds4_fifo_t;
  int32_t lsm6dsm_fifo_dataset_4_batch_set(const stmdev_ctx_t *ctx,
                                           lsm6dsm_dec_ds4_fifo_t val);
  int32_t lsm6dsm_fifo_dataset_4_batch_get(const stmdev_ctx_t *ctx,
                                           lsm6dsm_dec_ds4_fifo_t *val);

  int32_t lsm6dsm_fifo_xl_gy_8bit_format_set(const stmdev_ctx_t *ctx,
                                             uint8_t val);
  int32_t lsm6dsm_fifo_xl_gy_8bit_format_get(const stmdev_ctx_t *ctx,
                                             uint8_t *val);

  int32_t lsm6dsm_fifo_stop_on_wtm_set(const stmdev_ctx_t *ctx, uint8_t val);
  int32_t lsm6dsm_fifo_stop_on_wtm_get(const stmdev_ctx_t *ctx, uint8_t *val);

