liuhuaxijun/pro07_STM32F405RGT6_bike/Int/lsm6dsm_reg.h
  typedef enum
  {
    LSM6DSM_BYPASS_MODE = 0,
    LSM6DSM_FIFO_MODE = 1,
    LSM6DSM_STREAM_TO_FIFO_MODE = 3,
    LSM6DSM_BYPASS_TO_STREAM_MODE = 4,
    LSM6DSM_STREAM_MODE = 6,
  } lsm6dsm_fifo_mode_t;
  int32_t lsm6dsm_fifo_mode_set(const stmdev_ctx_t *ctx,
                                lsm6dsm_fifo_mode_t val);
  int32_t lsm6dsm_fifo_mode_get(const stmdev_ctx_t *ctx,
                                lsm6dsm_fifo_mode_t *val);

  typedef enum
  {
    LSM6DSM_FIFO_DISABLE = 0,
    LSM6DSM_FIFO_12Hz5 = 1,
    LSM6DSM_FIFO_26Hz = 2,
    LSM6DSM_FIFO_52Hz = 3,
    LSM6DSM_FIFO_104Hz = 4,
    LSM6DSM_FIFO_208Hz = 5,
    LSM6DSM_FIFO_416Hz = 6,
    LSM6DSM_FIFO_833Hz = 7,
    LSM6DSM_FIFO_1k66Hz = 8,
    LSM6DSM_FIFO_3k33Hz = 9,
    LSM6DSM_FIFO_6k66Hz = 10,
  } lsm6dsm_odr_fifo_t;
  int32_t lsm6dsm_fifo_data_rate_set(const stmdev_ctx_t *ctx,
                                     lsm6dsm_odr_fifo_t val);
  int32_t lsm6dsm_fifo_data_rate_get(const stmdev_ctx_t *ctx,
                                     lsm6dsm_odr_fifo_t *val);

  typedef enum
  {
    LSM6DSM_DEN_ACT_LOW = 0,
    LSM6DSM_DEN_ACT_HIGH = 1,
  } lsm6dsm_den_lh_t;
  int32_t lsm6dsm_den_polarity_set(const stmdev_ctx_t *ctx,
                                   lsm6dsm_den_lh_t val);
  int32_t lsm6dsm_den_polarity_get(const stmdev_ctx_t *ctx,
                                   lsm6dsm_den_lh_t *val);

  typedef enum
  {
    LSM6DSM_DEN_DISABLE = 0,
    LSM6DSM_LEVEL_FIFO = 6,
    LSM6DSM_LEVEL_LETCHED = 3,
    LSM6DSM_LEVEL_TRIGGER = 2,
    LSM6DSM_EDGE_TRIGGER = 4,
  } lsm6dsm_den_mode_t;
  int32_t lsm6dsm_den_mode_set(const stmdev_ctx_t *ctx,
                               lsm6dsm_den_mode_t val);
  int32_t lsm6dsm_den_mode_get(const stmdev_ctx_t *ctx,
                               lsm6dsm_den_mode_t *val);

  typedef enum
  {
    LSM6DSM_STAMP_IN_GY_DATA = 0,
    LSM6DSM_STAMP_IN_XL_DATA = 1,
    LSM6DSM_STAMP_IN_GY_XL_DATA = 2,
  } lsm6dsm_den_xl_en_t;
  int32_t lsm6dsm_den_enable_set(const stmdev_ctx_t *ctx,
                                 lsm6dsm_den_xl_en_t val);
  int32_t lsm6dsm_den_enable_get(const stmdev_ctx_t *ctx,
                                 lsm6dsm_den_xl_en_t *val);

  int32_t lsm6dsm_den_mark_axis_z_set(const stmdev_ctx_t *ctx, uint8_t val);
  int32_t lsm6dsm_den_mark_axis_z_get(const stmdev_ctx_t *ctx, uint8_t *val);

  int32_t lsm6dsm_den_mark_axis_y_set(const stmdev_ctx_t *ctx, uint8_t val);
  int32_t lsm6dsm_den_mark_axis_y_get(const stmdev_ctx_t *ctx, uint8_t *val);

  int32_t lsm6dsm_den_mark_axis_x_set(const stmdev_ctx_t *ctx, uint8_t val);
  int32_t lsm6dsm_den_mark_axis_x_get(const stmdev_ctx_t *ctx, uint8_t *val);

  int32_t lsm6dsm_pedo_step_reset_set(const stmdev_ctx_t *ctx, uint8_t val);
  int32_t lsm6dsm_pedo_step_reset_get(const stmdev_ctx_t *ctx, uint8_t *val);

  int32_t lsm6dsm_pedo_sens_set(const stmdev_ctx_t *ctx, uint8_t val);
  int32_t lsm6dsm_pedo_sens_get(const stmdev_ctx_t *ctx, uint8_t *val);

  int32_t lsm6dsm_pedo_threshold_set(const stmdev_ctx_t *ctx, uint8_t val);
  int32_t lsm6dsm_pedo_threshold_get(const stmdev_ctx_t *ctx, uint8_t *val);

  typedef enum
  {
    LSM6DSM_PEDO_AT_2g = 0,
    LSM6DSM_PEDO_AT_4g = 1,
  } lsm6dsm_pedo_fs_t;
  int32_t lsm6dsm_pedo_full_scale_set(const stmdev_ctx_t *ctx,
                                      lsm6dsm_pedo_fs_t val);
  int32_t lsm6dsm_pedo_full_scale_get(const stmdev_ctx_t *ctx,
                                      lsm6dsm_pedo_fs_t *val);

  int32_t lsm6dsm_pedo_debounce_steps_set(const stmdev_ctx_t *ctx,
                                          uint8_t val);
  int32_t lsm6dsm_pedo_debounce_steps_get(const stmdev_ctx_t *ctx,
                                          uint8_t *val);

  int32_t lsm6dsm_pedo_timeout_set(const stmdev_ctx_t *ctx, uint8_t val);
  int32_t lsm6dsm_pedo_timeout_get(const stmdev_ctx_t *ctx, uint8_t *val);

  int32_t lsm6dsm_pedo_steps_period_set(const stmdev_ctx_t *ctx,
                                        uint8_t *buff);
  int32_t lsm6dsm_pedo_steps_period_get(const stmdev_ctx_t *ctx,
                                        uint8_t *buff);

  int32_t lsm6dsm_motion_sens_set(const stmdev_ctx_t *ctx, uint8_t val);
  int32_t lsm6dsm_motion_sens_get(const stmdev_ctx_t *ctx, uint8_t *val);

  int32_t lsm6dsm_motion_threshold_set(const stmdev_ctx_t *ctx,
                                       uint8_t *buff);
  int32_t lsm6dsm_motion_threshold_get(const stmdev_ctx_t *ctx,
                                       uint8_t *buff);

  int32_t lsm6dsm_tilt_sens_set(const stmdev_ctx_t *ctx, uint8_t val);
  int32_t lsm6dsm_tilt_sens_get(const stmdev_ctx_t *ctx, uint8_t *val);

  int32_t lsm6dsm_wrist_tilt_sens_set(const stmdev_ctx_t *ctx, uint8_t val);
  int32_t lsm6dsm_wrist_tilt_sens_get(const stmdev_ctx_t *ctx, uint8_t *val);

  int32_t lsm6dsm_tilt_latency_set(const stmdev_ctx_t *ctx, uint8_t *buff);
  int32_t lsm6dsm_tilt_latency_get(const stmdev_ctx_t *ctx, uint8_t *buff);

  int32_t lsm6dsm_tilt_threshold_set(const stmdev_ctx_t *ctx, uint8_t *buff);
  int32_t lsm6dsm_tilt_threshold_get(const stmdev_ctx_t *ctx, uint8_t *buff);

  int32_t lsm6dsm_tilt_src_set(const stmdev_ctx_t *ctx,
                               lsm6dsm_a_wrist_tilt_mask_t *val);
  int32_t lsm6dsm_tilt_src_get(const stmdev_ctx_t *ctx,
                               lsm6dsm_a_wrist_tilt_mask_t *val);

  int32_t lsm6dsm_mag_soft_iron_set(const stmdev_ctx_t *ctx, uint8_t val);
  int32_t lsm6dsm_mag_soft_iron_get(const stmdev_ctx_t *ctx, uint8_t *val);

  int32_t lsm6dsm_mag_hard_iron_set(const stmdev_ctx_t *ctx, uint8_t val);
  int32_t lsm6dsm_mag_hard_iron_get(const stmdev_ctx_t *ctx, uint8_t *val);

  int32_t lsm6dsm_mag_soft_iron_mat_set(const stmdev_ctx_t *ctx,
                                        uint8_t *buff);
  int32_t lsm6dsm_mag_soft_iron_mat_get(const stmdev_ctx_t *ctx,
                                        uint8_t *buff);

  int32_t lsm6dsm_mag_offset_set(const stmdev_ctx_t *ctx, int16_t *val);
  int32_t lsm6dsm_mag_offset_get(const stmdev_ctx_t *ctx, int16_t *val);

  int32_t lsm6dsm_func_en_set(const stmdev_ctx_t *ctx, uint8_t val);

